"""
==================================
Author : "cpl"
Time : 22:20
Data : 2020/06/08
Project : web_study

===================================
"""
"""
1、.删除如下列表中的"矮穷丑"，写出 2 种或以上方法：
info = ["yuze", 18, "男", "矮穷丑", ["高", "富", "帅"], True, None, "狼的眼睛是啥样的"]
"""



"""
2、现在有一个列表 li2=[1，2，3，4，5]，
请通过相关的操作改成li2 = [0，1，2，3，66，4，5，11，22，33]，
"""


"""
3、请写出删除列表中元素的方法。
"""



"""
4、有5道小题（使用列表操作完成）：
a.  某相亲节目需要获取你的个人信息，请存储你的：姓名、性别、年龄
b. 有一个人对你很感兴趣，平台需要您补足您的身高和联系方式；
c, 平台为了保护你的隐私，需要你删除你的联系方式；
d, 你为了取得更好的成绩，需要取一个花名，并修改自己的身高和其他你觉得需要改的信息。
e, 你进一步添加自己的兴趣，至少需要 3 项(列表中成员可以是任意类型，此题考虑添加一个成员，且成员是列表哦！！！)。
"""