"""
==================================
Author : "cpl"
Time : 22:20
Data : 2020/06/08
Project : web_study

===================================
"""
"""上节课回顾：
格式：
def 函数名称(参数)
    函数实现
    return  #如果需要返回内容，就用return
            #分支/循环。在某一个分支退出函数，那就return
            #没有return，就返回None
"""

"""
全局变量不用重点掌握，用的少
 重点掌握:拆包
"""
"""
函数传参小妙招：拆包
调用函数时，可拆包
1、*：传递参数时可以对元组/列表拆包
eg：data=[1,2,3] 调用函数：func(*data) => func(1,2,3)
2、**：传递参数时可以对字典拆包
eg:data={"aa":11}   调用函数：func(**data) => func(aa = 11)
"""
"""
内置函数：
print:输出（常用）
input：输入
type：查看数据类型
id：获取数据内存地址
range:生成整数列（常用）
len：获取数据的长度（元素总数）（常用）
int、float、bool、str、list、tuple、dict、set：代表对应的数据类型
内置函数：min求最小值/max求最大值/sum求和
"""










